In [2]:
# Ignore
%load_ext sql
%sql sqlite://
%config SqlMagic.feedback = False

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### Create Data

In [4]:
%%sql

-- Create a table of criminals
CREATE TABLE criminals (pid, name, age, sex, city, minor);
INSERT INTO criminals VALUES (412, 'James Smith', 15, 'M', 'Santa Rosa', 1);
INSERT INTO criminals VALUES (234, NULL, 22, 'M', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (632, NULL, 23, 'F', 'San Francisco', 0);
INSERT INTO criminals VALUES (901, 'Gordon Ado', 32, 'F', 'San Francisco', 0);
INSERT INTO criminals VALUES (512, 'Bill Byson', 21, 'M', 'Petaluma', 0);

[]

### Write Some SQL Code With Single and Multiline Comments

In [9]:
%%sql

--  This is a single line of commenting
SELECT name, age

FROM criminals -- It can also be placed at the end of the line

/* This is multiple
lines of commments so we can include more
details if we need to. */
WHERE name IS NOT NULL

[('James Smith', 15), ('Gordon Ado', 32), ('Bill Byson', 21)]

Source: https://chrisalbon.com/sql/commenting_sql_code.html